### list comprehension
* syntax: [o/p-variable loop condition]

In [1]:
[i**2 for i in range(1,11)]

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [2]:
[i for i in range(1,51) if i%2==0]

[2,
 4,
 6,
 8,
 10,
 12,
 14,
 16,
 18,
 20,
 22,
 24,
 26,
 28,
 30,
 32,
 34,
 36,
 38,
 40,
 42,
 44,
 46,
 48,
 50]

In [3]:
import pandas as pd

In [4]:
s=pd.Series([i**2 for i in range(10,21)])
s

0     100
1     121
2     144
3     169
4     196
5     225
6     256
7     289
8     324
9     361
10    400
dtype: int64

In [5]:
s=pd.date_range(start="2023-11-1",end="2023-11-30")
s

DatetimeIndex(['2023-11-01', '2023-11-02', '2023-11-03', '2023-11-04',
               '2023-11-05', '2023-11-06', '2023-11-07', '2023-11-08',
               '2023-11-09', '2023-11-10', '2023-11-11', '2023-11-12',
               '2023-11-13', '2023-11-14', '2023-11-15', '2023-11-16',
               '2023-11-17', '2023-11-18', '2023-11-19', '2023-11-20',
               '2023-11-21', '2023-11-22', '2023-11-23', '2023-11-24',
               '2023-11-25', '2023-11-26', '2023-11-27', '2023-11-28',
               '2023-11-29', '2023-11-30'],
              dtype='datetime64[ns]', freq='D')

### Data Frame: 
* Data frame is a two-dimension size mutable heterogeneous tabular data
* like a table in an excel sheet

In [6]:
# creating data frame

l=[10,20,30,40,50]
df=pd.DataFrame(l)
df

    0
0  10
1  20
2  30
3  40
4  50

In [7]:
l=[[11,12,13],[14,15,16]]
df=pd.DataFrame(l)
df

    0   1   2
0  11  12  13
1  14  15  16

In [8]:
df.index=['x','y']   #changing row index

In [9]:
df

    0   1   2
x  11  12  13
y  14  15  16

In [10]:
df.columns=["col1","col2","col3"]  # changing col index
df

   col1  col2  col3
x    11    12    13
y    14    15    16

In [11]:
# creating data frame by using series

df=pd.DataFrame(pd.Series([10,20,30],index=[1,2,3]))
df

    0
1  10
2  20
3  30

In [12]:
# dictionary

d={"a":pd.Series([10,20,30,40],index=[1,2,3,4]),
  "b":pd.Series([50,60,70,80],index=[2,3,4,5]),
  "c":pd.Series([11,12,13],index=[1,2,3])}
df=pd.DataFrame(d)
df

      a     b     c
1  10.0   NaN  11.0
2  20.0  50.0  12.0
3  30.0  60.0  13.0
4  40.0  70.0   NaN
5   NaN  80.0   NaN

In [13]:
# combining dataframe (concat,append,merging)

d={"emp":pd.Series(['a','b','c','d'],index=[1,2,3,4]),
  "year":pd.Series([2023,2022,2021,2020],index=[1,2,3,4])}
df1=pd.DataFrame(d)
df1

  emp  year
1   a  2023
2   b  2022
3   c  2021
4   d  2020

In [17]:
# emp,dept


d={"emp":pd.Series(['a','b','c','e'],index=[1,2,3,4]),
  "dept":pd.Series(["op","hr","finance","others"],index=[1,2,3,4])}
df2=pd.DataFrame(d)
df2

  emp     dept
1   a       op
2   b       hr
3   c  finance
4   e   others

In [18]:
pd.merge(df1,df2)  # based on emp names

  emp  year     dept
0   a  2023       op
1   b  2022       hr
2   c  2021  finance

In [19]:
pd.merge(df1,df2,how="left")

  emp  year     dept
0   a  2023       op
1   b  2022       hr
2   c  2021  finance
3   d  2020      NaN

In [20]:
pd.merge(df1,df2,how="right")

  emp    year     dept
0   a  2023.0       op
1   b  2022.0       hr
2   c  2021.0  finance
3   e     NaN   others

In [2]:
# creating ditionary for student
import pandas as pd
s={"name":["sai","lokesh","swamy"],
  "rollno":[111,121,133],
  "branch":["IT","EEE","CSE"]}

df=pd.DataFrame(s)
df

     name  rollno branch
0     sai     111     IT
1  lokesh     121    EEE
2   swamy     133    CSE

In [3]:
# to get column names from dataframe

df.columns

Index(['name', 'rollno', 'branch'], dtype='object')

In [4]:
# to get row index
df.index

RangeIndex(start=0, stop=3, step=1)

In [5]:
# to get values from the dataframe

df.values

array([['sai', 111, 'IT'],
       ['lokesh', 121, 'EEE'],
       ['swamy', 133, 'CSE']], dtype=object)

In [6]:
# to get top 2 records

df.head(2)

     name  rollno branch
0     sai     111     IT
1  lokesh     121    EEE

In [7]:
# first record

df.head(1)

  name  rollno branch
0  sai     111     IT

In [8]:
# last record

df.tail(1)

    name  rollno branch
2  swamy     133    CSE

In [9]:
# to get bottom 2 records
df.tail(2)

     name  rollno branch
1  lokesh     121    EEE
2   swamy     133    CSE

In [10]:
# to get no of rows & columns in a data frame

df.shape

(3, 3)

In [11]:
df

     name  rollno branch
0     sai     111     IT
1  lokesh     121    EEE
2   swamy     133    CSE

In [12]:
df["name"]   # to access a particular column

0       sai
1    lokesh
2     swamy
Name: name, dtype: object

In [13]:
df[["rollno","branch"]]  # to get multiple columns

   rollno branch
0     111     IT
1     121    EEE
2     133    CSE

In [14]:
# to add a new column to existing data frame

df["marks"]=[90,86,78]
df

     name  rollno branch  marks
0     sai     111     IT     90
1  lokesh     121    EEE     86
2   swamy     133    CSE     78

In [15]:
# to sort data based on names

df.sort_values("name")

     name  rollno branch  marks
1  lokesh     121    EEE     86
0     sai     111     IT     90
2   swamy     133    CSE     78

In [16]:
df["python"]=[87,68,89]
df["java"]=[90,86,75]
df

     name  rollno branch  marks  python  java
0     sai     111     IT     90      87    90
1  lokesh     121    EEE     86      68    86
2   swamy     133    CSE     78      89    75

In [17]:
df["Total"]=df["python"]+df["java"]
df

     name  rollno branch  marks  python  java  Total
0     sai     111     IT     90      87    90    177
1  lokesh     121    EEE     86      68    86    154
2   swamy     133    CSE     78      89    75    164

In [18]:
df

     name  rollno branch  marks  python  java  Total
0     sai     111     IT     90      87    90    177
1  lokesh     121    EEE     86      68    86    154
2   swamy     133    CSE     78      89    75    164

In [19]:
# indexing 

# iloc -> integer based indexing
# loc -> both integer and string based indexing

In [20]:
df.iloc[1,1]

121

In [21]:
df.loc[df["name"]=="lokesh"]

     name  rollno branch  marks  python  java  Total
1  lokesh     121    EEE     86      68    86    154

In [22]:
df.loc[df["branch"]=="EEE"]

     name  rollno branch  marks  python  java  Total
1  lokesh     121    EEE     86      68    86    154

In [23]:
# get student records whose java marks are in between 85 and 95

df.loc[(df["java"]>85) & (df["java"]<95) ]

     name  rollno branch  marks  python  java  Total
0     sai     111     IT     90      87    90    177
1  lokesh     121    EEE     86      68    86    154

In [24]:
# to add a new record

df.loc[3]=["krishna",144,"ECE",98,84,75,159]
df

      name  rollno branch  marks  python  java  Total
0      sai     111     IT     90      87    90    177
1   lokesh     121    EEE     86      68    86    154
2    swamy     133    CSE     78      89    75    164
3  krishna     144    ECE     98      84    75    159

In [25]:
# to get row with index 1

df.iloc[1]

name      lokesh
rollno       121
branch       EEE
marks         86
python        68
java          86
Total        154
Name: 1, dtype: object

In [26]:
df.iloc[3]

name      krishna
rollno        144
branch        ECE
marks          98
python         84
java           75
Total         159
Name: 3, dtype: object

In [27]:
# to update particular value

df.loc[2,"marks"]=90
df

      name  rollno branch  marks  python  java  Total
0      sai     111     IT     90      87    90    177
1   lokesh     121    EEE     86      68    86    154
2    swamy     133    CSE     90      89    75    164
3  krishna     144    ECE     98      84    75    159

In [28]:
df.loc[3,"branch"]="EEE"
df

      name  rollno branch  marks  python  java  Total
0      sai     111     IT     90      87    90    177
1   lokesh     121    EEE     86      68    86    154
2    swamy     133    CSE     90      89    75    164
3  krishna     144    EEE     98      84    75    159

In [29]:
# renaming a particular column name

df.rename(columns={'marks':'Marks'},inplace=True)
df

      name  rollno branch  Marks  python  java  Total
0      sai     111     IT     90      87    90    177
1   lokesh     121    EEE     86      68    86    154
2    swamy     133    CSE     90      89    75    164
3  krishna     144    EEE     98      84    75    159

In [30]:
# renaming all the columns

df.columns=['Name','Rollno','Branch','Marks','Python','Java','Total']
df

      Name  Rollno Branch  Marks  Python  Java  Total
0      sai     111     IT     90      87    90    177
1   lokesh     121    EEE     86      68    86    154
2    swamy     133    CSE     90      89    75    164
3  krishna     144    EEE     98      84    75    159

In [31]:
# to rename row index

df.index=['a','b','c','d']
df

      Name  Rollno Branch  Marks  Python  Java  Total
a      sai     111     IT     90      87    90    177
b   lokesh     121    EEE     86      68    86    154
c    swamy     133    CSE     90      89    75    164
d  krishna     144    EEE     98      84    75    159

In [32]:
# to delete data from a dataframe

# drop
# axis=0  -> row based
# axis=1  -> column based

In [42]:
l=[[78,89,65],[45,32,24]]
df=pd.DataFrame(l)
df

    0   1   2
0  78  89  65
1  45  32  24

In [43]:
df.columns=["stu1","stu2","stu3"]
df

   stu1  stu2  stu3
0    78    89    65
1    45    32    24

In [44]:
# to delete 0th index records

df.drop(0,axis=0,inplace=True)
df

   stu1  stu2  stu3
1    45    32    24

In [45]:
# to delete stu3 column

df.drop("stu3",axis=1,inplace=True)
df

   stu1  stu2
1    45    32

In [46]:
df.loc[2]=[85,96]
df.loc[3]=[52,69]
df

   stu1  stu2
1    45    32
2    85    96
3    52    69

In [47]:
# to delete all the rows

df.drop(df.index,inplace=True)
df

Empty DataFrame
Columns: [stu1, stu2]
Index: []

In [49]:
# to delete all the columns

df.drop(df.columns,axis=1,inplace=True)
df

Empty DataFrame
Columns: []
Index: []

### File I/O

In [50]:
import pandas as pd

In [55]:
df=pd.read_csv("C://Users//meena//Downloads//Salary_Data.csv")
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [56]:
# to get no of rows and columns

df.shape

(6704, 6)

In [57]:
# to get column names

df.columns

Index(['Age', 'Gender', 'Education Level', 'Job Title', 'Years of Experience',
       'Salary'],
      dtype='object')

In [58]:
# row index
df.index

RangeIndex(start=0, stop=6704, step=1)

In [59]:
df.values

array([[32.0, 'Male', "Bachelor's", 'Software Engineer', 5.0, 90000.0],
       [28.0, 'Female', "Master's", 'Data Analyst', 3.0, 65000.0],
       [45.0, 'Male', 'PhD', 'Senior Manager', 15.0, 150000.0],
       ...,
       [30.0, 'Female', "Bachelor's Degree", 'Financial Manager', 4.0,
        55000.0],
       [46.0, 'Male', "Master's Degree", 'Marketing Manager', 14.0,
        140000.0],
       [26.0, 'Female', 'High School', 'Sales Executive', 1.0, 35000.0]],
      dtype=object)

In [60]:
df.describe()

               Age  Years of Experience         Salary
count  6702.000000          6701.000000    6699.000000
mean     33.620859             8.094687  115326.964771
std       7.614633             6.059003   52786.183911
min      21.000000             0.000000     350.000000
25%      28.000000             3.000000   70000.000000
50%      32.000000             7.000000  115000.000000
75%      38.000000            12.000000  160000.000000
max      62.000000            34.000000  250000.000000

In [61]:
# to get count of males and females

df["Gender"].value_counts()

Male      3674
Female    3014
Other       14
Name: Gender, dtype: int64

In [63]:
#  female
df["Gender"]=="Female"

0       False
1        True
2       False
3        True
4       False
        ...
6699     True
6700    False
6701     True
6702    False
6703     True
Name: Gender, Length: 6704, dtype: bool

In [64]:
# to get no of job-titles

df["Job Title"].value_counts()

Software Engineer             518
Data Scientist                453
Software Engineer Manager     376
Data Analyst                  363
Senior Project Engineer       318
                             ...
Account Manager                 1
Help Desk Analyst               1
Senior Training Specialist      1
Junior Web Designer             1
Supply Chain Analyst            1
Name: Job Title, Length: 193, dtype: int64

In [65]:
# to get records of data analyst job title

df[df["Job Title"]=="Data Analyst"]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
81,41.0,Female,Master's,Data Analyst,13.0,80000.0
378,27.0,Female,Bachelor's,Data Analyst,2.0,110000.0
382,25.0,Female,Master's,Data Analyst,1.0,100000.0
386,30.0,Female,Bachelor's,Data Analyst,5.0,145000.0
...,...,...,...,...,...,...
3360,34.0,Male,Master's Degree,Data Analyst,8.0,100000.0
3367,35.0,Female,Master's Degree,Data Analyst,9.0,120000.0
3374,37.0,Male,Bachelor's Degree,Data Analyst,11.0,160000.0
3377,34.0,Male,Master's Degree,Data Analyst,8.0,100000.0
3384,35.0,Female,Master's Degree,Data Analyst,9.0,120000.0

In [66]:
# to update any value

df.loc[2,"Education Level"]="PHD"
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PHD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [67]:
# to get maximum salary records

df[df["Salary"]==max(df["Salary"])]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
30,50.0,Male,Bachelor's,CEO,25.0,250000.0
83,52.0,Male,PhD,Chief Technology Officer,24.0,250000.0
5001,45.0,Male,Bachelor's Degree,Financial Manager,21.0,250000.0

In [69]:
# Sorting values based on salary

df.sort_values("Salary",ascending=False)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
83,52.0,Male,PhD,Chief Technology Officer,24.0,250000.0
30,50.0,Male,Bachelor's,CEO,25.0,250000.0
5001,45.0,Male,Bachelor's Degree,Financial Manager,21.0,250000.0
4306,51.0,Male,PhD,Data Scientist,24.0,240000.0
4366,51.0,Male,PhD,Data Scientist,24.0,240000.0
...,...,...,...,...,...,...
172,NaN,NaN,NaN,NaN,NaN,NaN
260,NaN,NaN,NaN,NaN,NaN,NaN
3136,31.0,Male,Master's Degree,Full Stack Engineer,8.0,NaN
5247,26.0,Female,Bachelor's Degree,Social M,NaN,NaN
6455,36.0,Male,Bachelor's Degree,Sales Director,6.0,NaN

In [71]:
df["Job Title"].unique()

array(['Software Engineer', 'Data Analyst', 'Senior Manager',
       'Sales Associate', 'Director', 'Marketing Analyst',
       'Product Manager', 'Sales Manager', 'Marketing Coordinator',
       'Senior Scientist', 'Software Developer', 'HR Manager',
       'Financial Analyst', 'Project Manager', 'Customer Service Rep',
       'Operations Manager', 'Marketing Manager', 'Senior Engineer',
       'Data Entry Clerk', 'Sales Director', 'Business Analyst',
       'VP of Operations', 'IT Support', 'Recruiter', 'Financial Manager',
       'Social Media Specialist', 'Software Manager', 'Junior Developer',
       'Senior Consultant', 'Product Designer', 'CEO', 'Accountant',
       'Data Scientist', 'Marketing Specialist', 'Technical Writer',
       'HR Generalist', 'Project Engineer', 'Customer Success Rep',
       'Sales Executive', 'UX Designer', 'Operations Director',
       'Network Engineer', 'Administrative Assistant',
       'Strategy Consultant', 'Copywriter', 'Account Manager',
       'Director of Marketing', 'Help Desk Analyst',
       'Customer Service Manager', 'Business Intelligence Analyst',
       'Event Coordinator', 'VP of Finance', 'Graphic Designer',
       'UX Researcher', 'Social Media Manager', 'Director of Operations',
       'Senior Data Scientist', 'Junior Accountant',
       'Digital Marketing Manager', 'IT Manager',
       'Customer Service Representative', 'Business Development Manager',
       'Senior Financial Analyst', 'Web Developer', 'Research Director',
       'Technical Support Specialist', 'Creative Director',
       'Senior Software Engineer', 'Human Resources Director',
       'Content Marketing Manager', 'Technical Recruiter',
       'Sales Representative', 'Chief Technology Officer',
       'Junior Designer', 'Financial Advisor', 'Junior Account Manager',
       'Senior Project Manager', 'Principal Scientist',
       'Supply Chain Manager', 'Senior Marketing Manager',
       'Training Specialist', 'Research Scientist',
       'Junior Software Developer', 'Public Relations Manager',
       'Operations Analyst', 'Product Marketing Manager',
       'Senior HR Manager', 'Junior Web Developer',
       'Senior Project Coordinator', 'Chief Data Officer',
       'Digital Content Producer', 'IT Support Specialist',
       'Senior Marketing Analyst', 'Customer Success Manager',
       'Senior Graphic Designer', 'Software Project Manager',
       'Supply Chain Analyst', 'Senior Business Analyst',
       'Junior Marketing Analyst', 'Office Manager', 'Principal Engineer',
       'Junior HR Generalist', 'Senior Product Manager',
       'Junior Operations Analyst', 'Senior HR Generalist',
       'Sales Operations Manager', 'Senior Software Developer',
       'Junior Web Designer', 'Senior Training Specialist',
       'Senior Research Scientist', 'Junior Sales Representative',
       'Junior Marketing Manager', 'Junior Data Analyst',
       'Senior Product Marketing Manager', 'Junior Business Analyst',
       'Senior Sales Manager', 'Junior Marketing Specialist',
       'Junior Project Manager', 'Senior Accountant', 'Director of Sales',
       'Junior Recruiter', 'Senior Business Development Manager',
       'Senior Product Designer', 'Junior Customer Support Specialist',
       'Senior IT Support Specialist', 'Junior Financial Analyst',
       'Senior Operations Manager', 'Director of Human Resources',
       'Junior Software Engineer', 'Senior Sales Representative',
       'Director of Product Management', 'Junior Copywriter',
       'Senior Marketing Coordinator', 'Senior Human Resources Manager',
       'Junior Business Development Associate', 'Senior Account Manager',
       'Senior Researcher', 'Junior HR Coordinator',
       'Director of Finance', 'Junior Marketing Coordinator', nan,
       'Junior Data Scientist', 'Senior Operations Analyst',
       'Senior Human Resources Coordinator', 'Senior UX Designer',
       'Junior Product Manager', 'Senior Marketing Specialist',
       'Senior IT Project Manager', 'Senior Quality Assurance Analyst',
       'Director of Sales and Marketing', 'Senior Account Executive',
       'Director of Business Development', 'Junior Social Media Manager',
       'Senior Human Resources Specialist', 'Senior Data Analyst',
       'Director of Human Capital', 'Junior Advertising Coordinator',
       'Junior UX Designer', 'Senior Marketing Director',
       'Senior IT Consultant', 'Senior Financial Advisor',
       'Junior Business Operations Analyst',
       'Junior Social Media Specialist',
       'Senior Product Development Manager', 'Junior Operations Manager',
       'Senior Software Architect', 'Junior Research Scientist',
       'Senior Financial Manager', 'Senior HR Specialist',
       'Senior Data Engineer', 'Junior Operations Coordinator',
       'Director of HR', 'Senior Operations Coordinator',
       'Junior Financial Advisor', 'Director of Engineering',
       'Software Engineer Manager', 'Back end Developer',
       'Senior Project Engineer', 'Full Stack Engineer',
       'Front end Developer', 'Developer', 'Front End Developer',
       'Director of Data Science', 'Human Resources Coordinator',
       'Junior Sales Associate', 'Human Resources Manager',
       'Juniour HR Generalist', 'Juniour HR Coordinator',
       'Digital Marketing Specialist', 'Receptionist',
       'Marketing Director', 'Social M', 'Social Media Man',
       'Delivery Driver'], dtype=object)

In [72]:
len(df["Job Title"].unique())

194

In [77]:
# statistics

df.max()

C:\Users\meena\AppData\Local\Temp\ipykernel_20672\357180599.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.max()

Age                        62.0
Years of Experience        34.0
Salary                 250000.0
dtype: float64

In [74]:
df.min()

C:\Users\meena\AppData\Local\Temp\ipykernel_20672\3962516015.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.min()

Age                     21.0
Years of Experience      0.0
Salary                 350.0
dtype: float64

In [75]:
df.std()

C:\Users\meena\AppData\Local\Temp\ipykernel_20672\3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

Age                        7.614633
Years of Experience        6.059003
Salary                 52786.183911
dtype: float64

In [76]:
df.mean()

C:\Users\meena\AppData\Local\Temp\ipykernel_20672\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Age                        33.620859
Years of Experience         8.094687
Salary                 115326.964771
dtype: float64